Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnZeroHeightFailure Property
 The column can't have zero height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnZeroHeightFailure { get; }
Public Shared ReadOnly Property ColumnZeroHeightFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnZeroHeightFailure {
	FailureDefinitionId^ get ();
}
static member ColumnZeroHeightFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace